pftbest/msp430_svd/msp430-gcc-support-files/include/msp430c325.h
sfr_w(AIN);                                   /* ADC Input */
sfr_w(AEN);                                   /* ADC Input Enable */

sfr_w(ACTL);                                  /* ADC Control */
/* the names of the mode bits are different from the spec */
#define ADSOC                  (0x0001)
#define ADSVCC                 (0x0002)
#define ADIN0                  (0x0004)
#define ADIN1                  (0x0008)
#define ADIN2                  (0x0010)
#define ADINOFF                (0x0020)
#define ADCSRC0                (0x0040)
#define ADCSRC1                (0x0080)
#define ADCSRCOFF              (0x0100)
#define ADRNG0                 (0x0200)
#define ADRNG1                 (0x0400)
#define ADAUTO                 (0x0800)
#define ADPD                   (0x1000)
/* Channel select coded with Bits 2-5 */
#define ADIN_A0                (0x0000)       /* (default) */
#define ADIN_A1                (ADIN0)
#define ADIN_A2                (ADIN1)
#define ADIN_A3                (ADIN1+ADIN0)
#define ADIN_A4                (ADIN2)
#define ADIN_A5                (ADIN2+ADIN0)
#define ADIN_A6                (ADIN2+ADIN1)
#define ADIN_A7                (ADIN2+ADIN1+ADIN0)
/* Current source output select coded with Bits 6-8 */
#define ADCSRC_A0              (0x0000)       /* (default) */
#define ADCSRC_A1              (ADCSRC0)
#define ADCSRC_A2              (ADCSRC1)
#define ADCSRC_A3              (ADCSRC1+ADCSRC0)
/* Range select coded with Bits 9-11 */
#define ADRNG_A                (0x0000)       /* 0<=Vin<1/4Vref  (default) */
#define ADRNG_B                (ADRNG0)       /* 1/4 Vref<=Vin<1/2 Vref */
#define ADRNG_C                (ADRNG1)       /* 1/2 Vref<=Vin<3/4 Vref */
#define ADRNG_D             (ADRNG1+ADRNG0)           /* 3/4 Vref<=Vin<1   Vref */
#define ADRNG_AUTO             (ADAUTO)       /* 0<=Vin<1   Vref auto detect range */

/* DATA REGISTER ADDRESS */
sfr_w(ADAT);                                  /* ADC Data */

/************************************************************
* EPROM CONTROL
************************************************************/
#define __MSP430_HAS_EPROM__                  /* Definition to show that Module is available */

sfr_b(EPCTL);                                 /* EPROM Control */
#define EPEXE                  (0x01)
#define EPVPPS                 (0x02)

/************************************************************
* Interrupt Vectors (offset from 0xFFE0)
************************************************************/

#define PORT0_VECTOR            ( 1)                     /* 0xFFE0 Port 0 Bits 2-7 [Lowest Priority] */
#define BASICTIMER_VECTOR       ( 2)                     /* 0xFFE2 Basic Timer */
#define TIMERPORT_VECTOR        ( 5)                     /* 0xFFE8 Timer/Port */
#define ADC_VECTOR              ( 6)                     /* 0xFFEA ADC */
#define WDT_VECTOR              (11)                     /* 0xFFF4 Watchdog Timer */
#define IO1_VECTOR              (13)                     /* 0xFFF8 Dedicated IO (P0.1) */
#define IO0_VECTOR              (14)                     /* 0xFFFA Dedicated IO (P0.0) */
#define NMI_VECTOR              (15)                     /* 0xFFFC Non-maskable */
#define RESET_VECTOR            ("reset")                /* 0xFFFE Reset [Highest Priority] */

/************************************************************
* End of Modules
************************************************************/

#ifdef __cplusplus
}
#endif /* extern "C" */

#endif /* #ifndef __msp430x32x */

